ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_ef_ctrl.c
    if (len >= 32) {
        mask = 0xffffffff;
    } else {
        mask = (1 << len) - 1;
    }

    if ((val & mask) == 0) {
        return 1;
    } else {
        return 0;
    }
}

/****************************************************************************/ /**
 * @brief  Efuse read chip ID
 *
 * @param  chipID[8]: Chip ID buffer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EF_Ctrl_Read_Chip_ID(uint8_t chipID[8])
{
    chipID[6] = 0;
    chipID[7] = 0;
    return EF_Ctrl_Read_MAC_Address_Raw(chipID);
}

/****************************************************************************/ /**
 * @brief  Efuse write AES key
 *
 * @param  keyRegion: efuse key region
 * @param  index: index of key slot
 * @param  keyData: key data buffer
 * @param  len: key data length in words
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Write_AES_Key(uint8_t index, uint32_t *keyData, uint32_t len, uint8_t program)
{
    uint32_t *pAESKeyStart0 = (uint32_t *)(EF_DATA_BASE + 0x1C);
    uint32_t *pAESKeyStart1 = (uint32_t *)(EF_DATA_BASE + 0x80);

    /* slot_w0~slot_w3,slot_w11 in ef_data0 
       slot_w4~slot_w10,in ef_data1 */

    if ((index <= 3) || (index == 11)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_0();

        index = ((index == 11) ? 5 : index);

        /* Every key is 4 words len*/

        ARCH_MemCpy4(pAESKeyStart0 + index * 4, keyData, len);

        if (program) {
            EF_Ctrl_Program_Efuse_0();
        }
    } else if ((index < 11) && (index > 3)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_1();

        index = index - 4;

        /* Every key is 4 words len*/
        ARCH_MemCpy4(pAESKeyStart1 + index * 4, keyData, len);

        if (program) {
            EF_Ctrl_Program_Efuse_1();
        }
    }
}

/****************************************************************************/ /**
 * @brief  Efuse read AES key from specified region and index
 *
 * @param  keyRegion: efuse key region
 * @param  index: index of key slot
 * @param  keyData: key data buffer
 * @param  len: key data length in words
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Read_AES_Key(uint8_t index, uint32_t *keyData, uint32_t len)
{
    uint32_t *pAESKeyStart0 = (uint32_t *)(EF_DATA_BASE + 0x1C);
    uint32_t *pAESKeyStart1 = (uint32_t *)(EF_DATA_BASE + 0x80);

    if ((index <= 3) || (index == 11)) {
        /* Trigger read data from efuse*/
        EF_CTRL_LOAD_BEFORE_READ_R0;

        index = ((index == 11) ? 5 : index);

        /* Every key is 4 words len*/
        ARCH_MemCpy4(keyData, pAESKeyStart0 + index * 4, len);
    } else if ((index < 11) && (index > 3)) {
        /* Trigger read data from efuse*/
        EF_CTRL_LOAD_BEFORE_READ_R1;
        index = index - 4;
        /* Every key is 4 words len*/
        ARCH_MemCpy4(keyData, pAESKeyStart1 + index * 4, len);
    }
}

/****************************************************************************/ /**
 * @brief  Efuse lock writing for aes key
 *
 * @param  keyRegion: efuse key region
 * @param  index: index of key slot
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Writelock_AES_Key(uint8_t index, uint8_t program)
{
    uint32_t tmpVal;

    if ((index <= 3) || (index == 11)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_0();

        index = ((index == 11) ? 8 : index);

        tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);
        tmpVal |= (1 << (index + 17));
        BL_WR_REG(EF_DATA_BASE, EF_DATA_0_LOCK, tmpVal);

        if (program) {
            EF_Ctrl_Program_Efuse_0();
        }
    } else if ((index < 11) && (index > 3)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_1();

        index = index - 4;

        tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_LOCK);
        tmpVal |= (1 << (index + 15));
        BL_WR_REG(EF_DATA_BASE, EF_DATA_1_LOCK, tmpVal);

        if (program) {
            EF_Ctrl_Program_Efuse_1();
        }
    }
}

/****************************************************************************/ /**
 * @brief  Efuse lock reading for aes key
 *
 * @param  keyRegion: efuse key region
 * @param  index: index of key slot
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Readlock_AES_Key(uint8_t index, uint8_t program)
{
    uint32_t tmpVal;

    if ((index <= 3) || (index == 11)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_0();

        index = ((index == 11) ? 4 : index);

        tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);
        tmpVal |= (1 << (index + 27));
        BL_WR_REG(EF_DATA_BASE, EF_DATA_0_LOCK, tmpVal);

        if (program) {
            EF_Ctrl_Program_Efuse_0();
        }
    } else if ((index < 11) && (index > 3)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_1();

        index = index - 4;

        tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_LOCK);
        tmpVal |= (1 << (index + 25));
        BL_WR_REG(EF_DATA_BASE, EF_DATA_1_LOCK, tmpVal);

        if (program) {
            EF_Ctrl_Program_Efuse_1();
        }
    }
}
/****************************************************************************/ /**
 * @brief  Program data to efuse
 *
 * @param  offset: offset of efuse address to program
 * @param  pword: data pointer to buffer which is aligned to word
 * @param  count: count of data in words to program
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Program_Direct(uint32_t offset, uint32_t *pword, uint32_t count)
{
    uint32_t *pEfuseStart = (uint32_t *)(EF_DATA_BASE + offset);
    uint32_t region0_count = 0, region1_count = 0;

    if (offset > 0x100 || (offset + count * 4) > 0x100) {
        return;
    }

    if (offset < 0x80) {
        if (offset + count * 4 <= 0x80) {
            region0_count = count;
        } else {
            region0_count = (0x80 - offset) / 4;
            region1_count = (offset + count * 4 - 0x80) / 4;
        }
    } else {
        region1_count = count;
    }

