ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_ef_ctrl.c
    if (region0_count > 0) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_0();

        /* Add delay for CLK to be stable */
        arch_delay_us(4);

        if (pword != NULL) {
            ARCH_MemCpy4(pEfuseStart, pword, region0_count);
            pEfuseStart += region0_count;
            pword += region0_count;
        }

        EF_Ctrl_Program_Efuse_0();
        arch_delay_us(100);
    }
    if (region1_count > 0) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_1();

        /* Add delay for CLK to be stable */
        arch_delay_us(4);

        if (pword != NULL) {
            ARCH_MemCpy4(pEfuseStart, pword, region1_count);
        }

        EF_Ctrl_Program_Efuse_1();
        arch_delay_us(100);
    }
}

/****************************************************************************/ /**
 * @brief  Read data from efuse
 *
 * @param  offset: offset of efuse address to read
 * @param  pword: data pointer to buffer which is aligned to word
 * @param  count: count of data in words to read
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Read_Direct(uint32_t offset, uint32_t *pword, uint32_t count)
{
    uint32_t *pEfuseStart = (uint32_t *)(EF_DATA_BASE + offset);
    uint32_t region0_count = 0, region1_count = 0;

    if (offset > 0x100 || (offset + count * 4) > 0x100) {
        return;
    }

    if (offset < 0x80) {
        if (offset + count * 4 <= 0x80) {
            region0_count = count;
        } else {
            region0_count = (0x80 - offset) / 4;
            region1_count = (offset + count * 4 - 0x80) / 4;
        }
    } else {
        region1_count = count;
    }

    if (region0_count > 0) {
        EF_CTRL_LOAD_BEFORE_READ_R0;
        ARCH_MemCpy4(pword, pEfuseStart, region0_count);
        pword += region0_count;
        pEfuseStart += region0_count;
    }
    if (region1_count > 0) {
        EF_CTRL_LOAD_BEFORE_READ_R1;
        ARCH_MemCpy4(pword, pEfuseStart, region0_count);
    }
}

/****************************************************************************/ /**
 * @brief  Clear efuse data register
 *
 * @param  region: index efuse region
 * @param  index: index of efuse in word
 * @param  len: data length
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION EF_Ctrl_Clear(uint8_t region, uint32_t index, uint32_t len)
{
    uint32_t *pEfuseStart0 = (uint32_t *)(EF_DATA_BASE + 0x00);
    uint32_t *pEfuseStart1 = (uint32_t *)(EF_DATA_BASE + 0x80);
    uint32_t i = 0;

    if (region == 0) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_0();

        /* Clear data */
        for (i = 0; i < len; i++) {
            pEfuseStart0[index + i] = 0;
        }
    } else if (region == 1) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_1();

        /* Clear data */
        for (i = 0; i < len; i++) {
            pEfuseStart1[index + i] = 0;
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  efuse ctrl crc enable
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Crc_Enable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(EF_CTRL_BASE, EF_CTRL_EF_CRC_CTRL_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, EF_CTRL_EF_CRC_TRIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, EF_CTRL_EF_CRC_MODE);
    tmpVal = BL_SET_REG_BIT(tmpVal, EF_CTRL_EF_CRC_DOUT_INV_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, EF_CTRL_EF_CRC_DOUT_ENDIAN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, EF_CTRL_EF_CRC_DIN_ENDIAN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, EF_CTRL_EF_CRC_INT_CLR);
    tmpVal = BL_CLR_REG_BIT(tmpVal, EF_CTRL_EF_CRC_INT_SET);
    BL_WR_REG(EF_CTRL_BASE, EF_CTRL_EF_CRC_CTRL_0, tmpVal);

    tmpVal = BL_RD_REG(EF_CTRL_BASE, EF_CTRL_EF_CRC_CTRL_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, EF_CTRL_EF_CRC_EN);
    BL_WR_REG(EF_CTRL_BASE, EF_CTRL_EF_CRC_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  efuse ctrl get crc busy status
 *
 * @param  None
 *
 * @return DISABLE or ENABLE
 *
*******************************************************************************/
BL_Sts_Type EF_Ctrl_Crc_Is_Busy(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(EF_CTRL_BASE, EF_CTRL_EF_CRC_CTRL_0);
    return (BL_Sts_Type)BL_IS_REG_BIT_SET(tmpVal, EF_CTRL_EF_CRC_BUSY);
}

/****************************************************************************/ /**
 * @brief  efuse ctrl set golden value
 *
 * @param  goldenValue: Crc golden value
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Crc_Set_Golden(uint32_t goldenValue)
{
    BL_WR_REG(EF_CTRL_BASE, EF_CTRL_EF_CRC_CTRL_4, goldenValue);
}

/****************************************************************************/ /**
 * @brief  efuse ctrl get crc result
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EF_Ctrl_Crc_Result(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(EF_CTRL_BASE, EF_CTRL_EF_CRC_CTRL_0);
    return (BL_Err_Type)BL_IS_REG_BIT_SET(tmpVal, EF_CTRL_EF_CRC_ERROR);
}

/****************************************************************************/ /**
 * @brief  efuse ctrl trim dcdc and ldo
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION EF_Ctrl_Trim_DCDC_And_LDO(void)
{
    uint32_t tmpVal = 0;
    Efuse_Ana_DCDC11_Trim_Type dcdc11;
    Efuse_Ana_DCDC18_Trim_Type dcdc18;
    Efuse_Ana_LDO28CIS_Vout_Trim_Type ldo28cis;
    Efuse_Ana_LDO15CIS_Vout_Trim_Type ldo15cis;
    Efuse_Ana_LDO18FLASH_Trim_Type ldo18flash;

    /* read efuse data_0, get trim value */
    EF_Ctrl_Sw_AHB_Clk_0();
    EF_CTRL_LOAD_BEFORE_READ_R0;
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_11_W3);
    dcdc11.trimDcdc11VoutAon = (tmpVal >> 26) & 0x0f;
    dcdc11.trimDcdc11VoutAonParity = (tmpVal >> 30) & 0x01;
    dcdc11.trimDcdc11VoutAonEn = (tmpVal >> 31) & 0x01;
    dcdc18.trimDcdc18VoutAon = (tmpVal >> 20) & 0x0f;
    dcdc18.trimDcdc18VoutAonParity = (tmpVal >> 24) & 0x01;
    dcdc18.trimDcdc18VoutAonEn = (tmpVal >> 25) & 0x01;
    ldo28cis.trimLDO28CISVout = (tmpVal >> 8) & 0xf;
    ldo28cis.trimLDO28CISVoutParity = (tmpVal >> 12) & 0x01;
    ldo28cis.trimLDO28CISVoutEn = (tmpVal >> 13) & 0x01;
    ldo15cis.trimLDO15CISVout = (tmpVal >> 8) & 0xf;
    ldo15cis.trimLDO15CISVoutParity = (tmpVal >> 12) & 0x01;
    ldo15cis.trimLDO15CISVoutEn = (tmpVal >> 13) & 0x01;

