ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_ef_ctrl.c
    /* read efuse data_1, get trim value */
    EF_Ctrl_Sw_AHB_Clk_1();
    EF_CTRL_LOAD_BEFORE_READ_R1;
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_EF_KEY_SLOT_10_W3);
    ldo18flash.trimLdo18flashVoutAon = (tmpVal >> 26) & 0x0f;
    ldo18flash.trimLdo18flashVoutAonParity = (tmpVal >> 30) & 0x01;
    ldo18flash.trimLdo18flashVoutAonEn = (tmpVal >> 31) & 0x01;

    /* trim */
    if (dcdc11.trimDcdc11VoutAonEn) {
        if (dcdc11.trimDcdc11VoutAonParity == EF_Ctrl_Get_Trim_Parity(dcdc11.trimDcdc11VoutAon, 4)) {
            tmpVal = BL_RD_REG(AON_BASE, AON_DCDC_TOP_0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_DCDC11_VOUT_TRIM_AON, dcdc11.trimDcdc11VoutAon);
            BL_WR_REG(AON_BASE, AON_DCDC_TOP_0, tmpVal);
            return SUCCESS;
        }
    }
    if (dcdc18.trimDcdc18VoutAonEn) {
        if (dcdc18.trimDcdc18VoutAonParity == EF_Ctrl_Get_Trim_Parity(dcdc18.trimDcdc18VoutAon, 4)) {
            tmpVal = BL_RD_REG(AON_BASE, AON_DCDC18_TOP_0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_DCDC18_VOUT_TRIM_AON, dcdc18.trimDcdc18VoutAon);
            BL_WR_REG(AON_BASE, AON_DCDC18_TOP_0, tmpVal);
            return SUCCESS;
        }
    }
    if (ldo28cis.trimLDO28CISVoutEn) {
        if (ldo28cis.trimLDO28CISVoutParity == EF_Ctrl_Get_Trim_Parity(ldo28cis.trimLDO28CISVout, 4)) {
            tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO28CIS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO28CIS_VOUT_TRIM, ldo28cis.trimLDO28CISVout);
            BL_WR_REG(GLB_BASE, GLB_LDO28CIS, tmpVal);
            return SUCCESS;
        }
    }
    if (ldo15cis.trimLDO15CISVoutEn) {
        if (ldo15cis.trimLDO15CISVoutParity == EF_Ctrl_Get_Trim_Parity(ldo15cis.trimLDO15CISVout, 4)) {
            tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO15CIS);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO15CIS_VOUT_TRIM, ldo15cis.trimLDO15CISVout);
            BL_WR_REG(GLB_BASE, GLB_LDO15CIS, tmpVal);
            return SUCCESS;
        }
    }
    if (ldo18flash.trimLdo18flashVoutAonEn) {
        if (ldo18flash.trimLdo18flashVoutAonParity == EF_Ctrl_Get_Trim_Parity(ldo18flash.trimLdo18flashVoutAon, 4)) {
            tmpVal = BL_RD_REG(GLB_BASE, GLB_LDO18FLASH);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_LDO18FLASH_VOUT_TRIM, ldo18flash.trimLdo18flashVoutAon);
            BL_WR_REG(GLB_BASE, GLB_LDO18FLASH, tmpVal);
            return SUCCESS;
        }
    }

    return SUCCESS;
}

/*@} end of group SEC_EF_CTRL_Public_Functions */

/*@} end of group SEC_EF_CTRL */

/*@} end of group BL606P_Peripheral_Driver */
